bigroot969/VSCode_STM32_Demo/Hardware/Menu.c
		// 持续显示存储状态
		if (ToggleSaveFlag == 1)
		{
			LCD_ShowChinese(80, 140, "存储中", LCD_16X16, BLUE, WHITE, 1);
		}
		else
		{
			NowTotalRecords = DataStorage_GetCount();
			if (NowTotalRecords >= MaxRecordCount)
			{
				LCD_ShowChinese(80, 140, " 已满 ", LCD_16X16, RED, WHITE, 1);
			}
		}

		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			SetFlag--;
			if (SetFlag == 0)
			{
				SetFlag = 5;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			SetFlag++;
			if (SetFlag == 6)
			{
				SetFlag = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			Menu3_Set = SetFlag;
		}
		if (Menu3_Set == 1)
		{
			return 0;
		}
		if (Menu3_Set == 2)
		{
			Menu3_Set = Menu3_SetDate();
		}
		if (Menu3_Set == 3)
		{
			Menu3_Set = Menu3_SetLight();
		}
		if (Menu3_Set == 4)
		{
			Menu3_Set = Menu3_SetTemp();
		}
		if (Menu3_Set == 5)
		{
			Menu3_Set = Menu3_SetLength();
		}
		switch (SetFlag)
		{
		case 1:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 40, "日期时间", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "光照阈值", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 80, "温度阈值", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 100, "单次步长", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowNum(72, 100, StepLength, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowNum(72, 60, LightValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowNum(72, 80, TempValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		case 2:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "日期时间", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 60, "光照阈值", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 80, "温度阈值", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 100, "单次步长", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowNum(72, 100, StepLength, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowNum(72, 60, LightValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowNum(72, 80, TempValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		case 3:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "日期时间", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "光照阈值", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 80, "温度阈值", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 100, "单次步长", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowNum(72, 100, StepLength, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowNum(72, 60, LightValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowNum(72, 80, TempValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		case 4:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "日期时间", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "光照阈值", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 80, "温度阈值", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 100, "单次步长", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowNum(72, 100, StepLength, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowNum(72, 60, LightValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowNum(72, 80, TempValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		case 5:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "日期时间", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "光照阈值", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 80, "温度阈值", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 100, "单次步长", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowNum(72, 100, StepLength, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowNum(72, 60, LightValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowNum(72, 80, TempValue, LCD_8X16, BLACK, WHITE, 0, 0, 0);
			LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		}
	}
}

int Menu2_Function(void)
{
	uint8_t FunctionFlag = 1;
	uint8_t Menu2_Finction = 0;
	LCD_ShowChinese(0, 0, "功能", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "音乐播放", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "秒表", LCD_16X16, BLACK, WHITE, 0);
	while (1)
	{
		// 自动存储处理（读取实时传感器数据）
		if (SaveFlag == 1 && ToggleSaveFlag == 1)
		{
			SaveFlag = 0;
			MyRTC_ReadTime();
			CurrentTime.Year = MyRTC_Time[0];
			CurrentTime.Month = MyRTC_Time[1];
			CurrentTime.Day = MyRTC_Time[2];
			CurrentTime.Hour = MyRTC_Time[3];
			CurrentTime.Minute = MyRTC_Time[4];
			CurrentTime.Second = MyRTC_Time[5];
			// 读取实时传感器数据
			float tempData = DS18B20_Get_Temp();
			uint16_t lightData = LDR_LuxData();
			uint8_t saveResult = DataStorage_Save(tempData, lightData, &CurrentTime);
			if (saveResult == 1)
			{
				ToggleSaveFlag = 0; // 存储已满，停止自动存储
			}
		}

		// 持续显示存储状态
		if (ToggleSaveFlag == 1)
		{
			LCD_ShowChinese(80, 140, "存储中", LCD_16X16, BLUE, WHITE, 1);
		}
		else
		{
			NowTotalRecords = DataStorage_GetCount();
			if (NowTotalRecords >= MaxRecordCount)
			{
				LCD_ShowChinese(80, 140, " 已满 ", LCD_16X16, RED, WHITE, 1);
			}
		}

		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			FunctionFlag--;
			if (FunctionFlag == 0)
			{
				FunctionFlag = 3;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			FunctionFlag++;
			if (FunctionFlag == 4)
			{
				FunctionFlag = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			Menu2_Finction = FunctionFlag;
		}
		if (Menu2_Finction == 1)
		{
			return 0;
		}
		if (Menu2_Finction == 2)
		{
			Menu2_Finction = Menu3_Music();
		}
		if (Menu2_Finction == 3)
		{
			Menu2_Finction = Menu3_StopWatch();
		}
		switch (FunctionFlag)
		{
		case 1:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 40, "音乐播放", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "秒表", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 0, "功能", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		case 2:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "音乐播放", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 60, "秒表", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 0, "功能", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		case 3:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "音乐播放", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "秒表", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 0, "功能", LCD_16X16, BLACK, WHITE, 1);
			break;
		}
		}
	}
}

