bigroot969/VSCode_STM32_Demo/Hardware/Menu.c
int Menu3_Music(void)
{
	uint8_t PlayerFlag = 1;
	uint8_t CurrentMusic = 1;

	LCD_ShowChinese(0, 0, "音乐播放", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowChinese(0, 60, "当前播放", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowString(104, 40, ">>>", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 144, "暂停", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(96, 144, "退出", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 80, "小星星", LCD_16X16, BLACK, WHITE, 1);
	LCD_DrawRectangle(1, 120, 125, 126, BLACK); // 绘制进度条边框
	Buzzer_PauseFlag = 1;
	Buzzer_FinishFlag = 0;
	Buzzer_Progress = 0;
	Buzzer_Speed = BPM2Speed(MusicBPM[CurrentMusic - 1]);
	while (1)
	{
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			PlayerFlag--;
			if (PlayerFlag == 0)
			{
				PlayerFlag = 4;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			PlayerFlag++;
			if (PlayerFlag == 5)
			{
				PlayerFlag = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			switch (PlayerFlag)
			{
			case 1:
			{
				if (Buzzer_PauseFlag || Buzzer_FinishFlag)
				{
					CurrentMusic--;
					if (CurrentMusic == 0)
					{
						CurrentMusic = Music_Count;
					}
					switch (CurrentMusic)
					{
					case 1:
						LCD_ShowChinese(0, 80, "    小星星    ", LCD_16X16, BLACK, WHITE, 1);
						break;
					case 2:
						LCD_ShowChinese(0, 80, "   天空之城   ", LCD_16X16, BLACK, WHITE, 1);
						break;
					case 3:
						LCD_ShowChinese(0, 80, "    春日影    ", LCD_16X16, BLACK, WHITE, 1);
						break;
					case 4:
						LCD_ShowChinese(0, 80, "   口琴M-7    ", LCD_16X16, BLACK, WHITE, 1);
						break;
					case 5:
						LCD_ShowString(0, 80, "Light of Nibel", LCD_8X16, BLACK, WHITE, 1);
						break;
					}
					Buzzer_Speed = BPM2Speed(MusicBPM[CurrentMusic - 1]);
					Buzzer_FinishFlag = 0;
					Buzzer_Progress = 0;
					Buzzer_PauseFlag = 1;
				}
				LCD_DrawRectangle_Fill(3, 121, 124, 125, WHITE);
				break;
			}
			case 2:
			{
				if (Buzzer_PauseFlag || Buzzer_FinishFlag)
				{
					CurrentMusic++;
					if (CurrentMusic == Music_Count + 1)
					{
						CurrentMusic = 1;
					}
					switch (CurrentMusic)
					{
					case 1:
						LCD_ShowChinese(0, 80, "    小星星    ", LCD_16X16, BLACK, WHITE, 1);
						break;
					case 2:
						LCD_ShowChinese(0, 80, "   天空之城   ", LCD_16X16, BLACK, WHITE, 1);
						break;
					case 3:
						LCD_ShowChinese(0, 80, "    春日影    ", LCD_16X16, BLACK, WHITE, 1);
						break;
					case 4:
						LCD_ShowChinese(0, 80, "   口琴M-7    ", LCD_16X16, BLACK, WHITE, 1);
						break;
					case 5:
						LCD_ShowString(0, 80, "Light of Nibel", LCD_8X16, BLACK, WHITE, 1);
						break;
					}
					Buzzer_Speed = BPM2Speed(MusicBPM[CurrentMusic - 1]);
					Buzzer_FinishFlag = 0;
					Buzzer_PauseFlag = 1;
					Buzzer_Progress = 0;
				}
				LCD_DrawRectangle_Fill(3, 121, 124, 125, WHITE);
				break;
			}
			case 3:
			{
				if (Buzzer_FinishFlag)
				{
					LCD_DrawRectangle_Fill(4, 122, 124, 124, WHITE);
					Buzzer_FinishFlag = 0;
					Buzzer_PauseFlag = 0;
					Buzzer_Progress = 0;
				}
				else
				{
					Buzzer_PauseFlag = !Buzzer_PauseFlag; // 翻转状态（核心修正）
					if (Buzzer_PauseFlag)				  // 切换到暂停
					{
						Buzzer_OFF();
					}
				}
				break;
			}
			case 4:
			{
				Buzzer_OFF();
				Buzzer_Progress = 0;
				LCD_Clear(WHITE);
				return 0;
			}
			}
		}
		switch (PlayerFlag)
		{
		case 1:
		{
			LCD_ShowString(0, 40, "<<<", LCD_8X16, WHITE, BLACK, 0);
			LCD_ShowString(104, 40, ">>>", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(96, 144, "退出", LCD_16X16, BLACK, WHITE, 0);
			if (Buzzer_PauseFlag == 1) // 如果是暂停状态
			{
				LCD_ShowChinese(0, 144, "暂停", LCD_16X16, BLACK, WHITE, 0); // 显示"PAUSE"（黑字白底）
			}
			else // 如果是播放状态
			{
				LCD_ShowChinese(0, 144, "播放", LCD_16X16, BLACK, WHITE, 0); // 显示"PLAY "（黑字白底，空格用于对齐）
			}
			break;
		}
		case 2:
		{
			LCD_ShowString(0, 40, "<<<", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowString(104, 40, ">>>", LCD_8X16, WHITE, BLACK, 0);
			LCD_ShowChinese(96, 144, "退出", LCD_16X16, BLACK, WHITE, 0);
			if (Buzzer_PauseFlag == 1) // 如果是暂停状态
			{
				LCD_ShowChinese(0, 144, "暂停", LCD_16X16, BLACK, WHITE, 0); // 显示"PAUSE"（黑字白底）
			}
			else // 如果是播放状态
			{
				LCD_ShowChinese(0, 144, "播放", LCD_16X16, BLACK, WHITE, 0); // 显示"PLAY "（黑字白底，空格用于对齐）
			}
			break;
		}
		case 3:
		{
			LCD_ShowString(0, 40, "<<<", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowString(104, 40, ">>>", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(96, 144, "退出", LCD_16X16, BLACK, WHITE, 0);
			if (Buzzer_PauseFlag == 1) // 如果是暂停状态
			{
				LCD_ShowChinese(0, 144, "暂停", LCD_16X16, WHITE, BLACK, 0); // 显示"PAUSE"（黑字白底）
			}
			else // 如果是播放状态
			{
				LCD_ShowChinese(0, 144, "播放", LCD_16X16, WHITE, BLACK, 0); // 显示"PLAY "（黑字白底，空格用于对齐）
			}
			break;
		}
		case 4:
		{
			LCD_ShowString(0, 40, "<<<", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowString(104, 40, ">>>", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(96, 144, "退出", LCD_16X16, WHITE, BLACK, 0);
			if (Buzzer_PauseFlag == 1) // 如果是暂停状态
			{
				LCD_ShowChinese(0, 144, "暂停", LCD_16X16, BLACK, WHITE, 0); // 显示"PAUSE"（黑字白底）
			}
			else // 如果是播放状态
			{
				LCD_ShowChinese(0, 144, "播放", LCD_16X16, BLACK, WHITE, 0); // 显示"PLAY "（黑字白底，空格用于对齐）
			}
			break;
		}
		}
		if (!Buzzer_PauseFlag && !Buzzer_FinishFlag)
		{
			switch (CurrentMusic)
			{
			case 1:
			{
				Buzzer_Play(LittleStar);
				break;
			}
			case 2:
			{
				Buzzer_Play(CastleInTheSky);
				break;
			}
			case 3:
			{
				Buzzer_Play(Haruhikage);
				break;
			}
			case 4:
			{
				Buzzer_Play(Orb);
				break;
			}
			case 5:
			{
				Buzzer_Play(Ori);
				break;
			}
			}
		}
		LCD_DrawRectangle_Fill(3, 122, Buzzer_Progress + 2, 124, BLUE2); // 更新进度条
	}
}

int Menu2_History(void)
{
	uint8_t Menu2_HistoryFlag = 0;
	uint8_t HisFlag = 1;
	NowTotalRecords = DataStorage_GetCount();
	LCD_Clear(WHITE);
	LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "读取记录", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 80, "擦除数据", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 100, "记录数", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 120, "数据图表", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowNum(96, 100, MaxRecordCount, LCD_8X16, BLACK, WHITE, 0, 1, 3);
	LCD_ShowNum(64, 100, NowTotalRecords, LCD_8X16, BLACK, WHITE, 0, 1, 3);
	while (1)
	{
		// 自动存储处理（读取实时传感器数据）
		if (SaveFlag == 1 && ToggleSaveFlag == 1)
		{
			SaveFlag = 0;
			MyRTC_ReadTime();
			CurrentTime.Year = MyRTC_Time[0];
			CurrentTime.Month = MyRTC_Time[1];
			CurrentTime.Day = MyRTC_Time[2];
			CurrentTime.Hour = MyRTC_Time[3];
			CurrentTime.Minute = MyRTC_Time[4];
			CurrentTime.Second = MyRTC_Time[5];
			// 读取实时传感器数据
			float tempData = DS18B20_Get_Temp();
			uint16_t lightData = LDR_LuxData();
			uint8_t saveResult = DataStorage_Save(tempData, lightData, &CurrentTime);
			if (saveResult == 1)
			{
				ToggleSaveFlag = 0; // 存储已满，停止自动存储
			}
			// 更新当前记录数显示
			NowTotalRecords = DataStorage_GetCount();
		}

