bigroot969/VSCode_STM32_Demo/Hardware/Menu.c
		// 持续显示存储状态
		if (ToggleSaveFlag == 1)
		{
			LCD_ShowChinese(80, 140, "存储中", LCD_16X16, BLUE, WHITE, 1);
		}
		else
		{
			if (NowTotalRecords >= MaxRecordCount)
			{
				LCD_ShowChinese(80, 140, " 已满 ", LCD_16X16, RED, WHITE, 1);
			}
		}

		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			HisFlag--;
			if (HisFlag == 0)
			{
				HisFlag = 6;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			HisFlag++;
			if (HisFlag == 7)
			{
				HisFlag = 1;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			Menu2_HistoryFlag = HisFlag;
		}
		if (Menu2_HistoryFlag == 1)
		{
			return 0;
		}
		if (Menu2_HistoryFlag == 2)
		{
			Menu2_HistoryFlag = Menu3_AutoSaveSet();
		}
		if (Menu2_HistoryFlag == 3)
		{
			Menu2_HistoryFlag = Menu3_ReadRecord();
		}
		if (Menu2_HistoryFlag == 4)
		{
			Menu2_HistoryFlag = Menu3_ChipErase();
		}
		if (Menu2_HistoryFlag == 5)
		{
			Menu2_HistoryFlag = Menu3_SetMaxRecord();
		}
		if (Menu2_HistoryFlag == 6)
		{
			Menu2_HistoryFlag = Menu3_ShowGraph();
		}
		switch (HisFlag)
		{
		case 1:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "读取记录", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 80, "擦除数据", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 100, "记录数", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 120, "数据图表", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowNum(96, 100, MaxRecordCount, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowNum(64, 100, NowTotalRecords, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowString(88, 100, "/", LCD_8X16, BLACK, WHITE, 0);
			break;
		}
		case 2:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 60, "读取记录", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 80, "擦除数据", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 100, "记录数", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 120, "数据图表", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowNum(96, 100, MaxRecordCount, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowNum(64, 100, NowTotalRecords, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowString(88, 100, "/", LCD_8X16, BLACK, WHITE, 0);
			break;
		}
		case 3:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "读取记录", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 80, "擦除数据", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 100, "记录数", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 120, "数据图表", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowNum(96, 100, MaxRecordCount, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowNum(64, 100, NowTotalRecords, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowString(88, 100, "/", LCD_8X16, BLACK, WHITE, 0);
			break;
		}
		case 4:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "读取记录", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 80, "擦除数据", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 100, "记录数", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 120, "数据图表", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowNum(96, 100, MaxRecordCount, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowNum(64, 100, NowTotalRecords, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowString(88, 100, "/", LCD_8X16, BLACK, WHITE, 0);
			break;
		}
		case 5:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "读取记录", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 80, "擦除数据", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 100, "记录数", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 120, "数据图表", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowNum(96, 100, MaxRecordCount, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowNum(64, 100, NowTotalRecords, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowString(88, 100, "/", LCD_8X16, BLACK, WHITE, 0);
			break;
		}
		case 6:
		{
			LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 60, "读取记录", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 80, "擦除数据", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 100, "记录数", LCD_16X16, BLACK, WHITE, 0);
			LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
			LCD_ShowChinese(0, 120, "数据图表", LCD_16X16, WHITE, BLACK, 0);
			LCD_ShowNum(96, 100, MaxRecordCount, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowNum(64, 100, NowTotalRecords, LCD_8X16, BLACK, WHITE, 0, 1, 3);
			LCD_ShowString(88, 100, "/", LCD_8X16, BLACK, WHITE, 0);
			break;
		}
		}
	}
}

int Menu3_SetDate(void)
{
	uint8_t DateFlag = 1;
	uint8_t SwitchDateFlag = 0; // 初始为0（切换模式）
	LCD_ShowChinese(0, 40, "日期:", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "时间:", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 1);
	// 显示日期时间分隔符
	LCD_ShowString(72, 40, "-", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(96, 40, "-", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(64, 60, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(88, 60, ":", LCD_8X16, BLACK, WHITE, 0);
	// 显示日期时间，当前设置项高亮或闪烁
	LCD_ShowNum(40, 40, MyRTC_Time[0], LCD_8X16, BLACK, WHITE, 0, 0, 4);  // 年
	LCD_ShowNum(80, 40, MyRTC_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 月
	LCD_ShowNum(104, 40, MyRTC_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 日
	LCD_ShowNum(48, 60, MyRTC_Time[3], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 时
	LCD_ShowNum(72, 60, MyRTC_Time[4], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 分
	LCD_ShowNum(96, 60, MyRTC_Time[5], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 秒
	while (1)
	{
		if (SwitchDateFlag == 0) // 切换模式
		{
			if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
			{
				DateFlag--;
				if (DateFlag == 0)
				{
					DateFlag = 6;
				}
			}
			else if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
			{
				DateFlag++;
				if (DateFlag == 7)
				{
					DateFlag = 1;
				}
			}
		}
		else if (SwitchDateFlag == 1) // 调整模式
		{
			if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT)) // KEY_1：减少
			{
				switch (DateFlag)
				{
				case 1: // 年份
				{
					if (MyRTC_Time[0] <= 2000)
					{
						MyRTC_Time[0] = 2099;
					}
					else
					{
						MyRTC_Time[0]--;
					}
					break;
				}
				case 2: // 月份
				{
					if (MyRTC_Time[1] <= 1)
					{
						MyRTC_Time[1] = 12;
					}
					else
					{
						MyRTC_Time[1]--;
					}
					break;
				}
				case 3: // 日期
				{
					if (MyRTC_Time[2] <= 1)
					{
						MyRTC_Time[2] = 31;
					}
					else
					{
						MyRTC_Time[2]--;
					}
					break;
				}
				case 4: // 小时
				{
					if (MyRTC_Time[3] == 0)
					{
						MyRTC_Time[3] = 23;
					}
					else
					{
						MyRTC_Time[3]--;
					}
					break;
				}
				case 5: // 分钟
				{
					if (MyRTC_Time[4] == 0)
					{
						MyRTC_Time[4] = 59;
					}
					else
					{
						MyRTC_Time[4]--;
					}
					break;
				}
				case 6: // 秒
				{
					if (MyRTC_Time[5] == 0)
					{
						MyRTC_Time[5] = 59;
					}
					else
					{
						MyRTC_Time[5]--;
					}
					break;
				}
				}
			}
			else if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT)) // KEY_2：增加
			{
				switch (DateFlag)
				{
				case 1: // 年份
				{
					MyRTC_Time[0]++;
					if (MyRTC_Time[0] >= 2100)
					{
						MyRTC_Time[0] = 2000;
					}
					break;
				}
				case 2: // 月份
				{
					MyRTC_Time[1]++;
					if (MyRTC_Time[1] >= 13)
					{
						MyRTC_Time[1] = 1;
					}
					break;
				}
				case 3: // 日期  // 日期
				{
					MyRTC_Time[2]++;
					if (MyRTC_Time[2] >= 32)
					{
						MyRTC_Time[2] = 1;
					}
					break;
				}
				case 4: // 小时  // 小时
				{
					MyRTC_Time[3]++;
					if (MyRTC_Time[3] >= 24)
					{
						MyRTC_Time[3] = 0;
					}
					break;
				}
				case 5: // 分钟  // 分钟
				{
					MyRTC_Time[4]++;
					if (MyRTC_Time[4] >= 60)
					{
						MyRTC_Time[4] = 0;
					}
					break;
				}
				case 6: // 秒  // 秒
				{
					MyRTC_Time[5]++;
					if (MyRTC_Time[5] >= 60)
					{
						MyRTC_Time[5] = 0;
					}
					break;
				}
				}
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			SwitchDateFlag = !SwitchDateFlag;
		}
		else if (Key_Check(KEY_3, KEY_LONG))
		{
			LCD_Clear(WHITE);
			LCD_ShowChinese(0, 0, "设置", LCD_16X16, BLACK, WHITE, 1);
			MyRTC_SetTime();
			return 0;
		}
		if (SwitchDateFlag == 0)
		{
			LCD_ShowChinese(0, 120, "切换", LCD_16X16, BLACK, WHITE, 1);
		}
		else
		{
			LCD_ShowChinese(0, 120, "调整", LCD_16X16, BLACK, WHITE, 1);
		}
		switch (DateFlag)
		{
		case 1:																	  // 设置年份
			LCD_ShowNum(40, 40, MyRTC_Time[0], LCD_8X16, WHITE, BLACK, 0, 0, 4);  // 年
			LCD_ShowNum(80, 40, MyRTC_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 月
			LCD_ShowNum(104, 40, MyRTC_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2); // 日
			LCD_ShowNum(48, 60, MyRTC_Time[3], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 时
			LCD_ShowNum(72, 60, MyRTC_Time[4], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 分
			LCD_ShowNum(96, 60, MyRTC_Time[5], LCD_8X16, BLACK, WHITE, 0, 1, 2);  // 秒
			break;

