bigroot969/VSCode_STM32_Demo/Hardware/Menu.c
	// 如果没有记录，显示提示信息并退出
	if (totalRecords == 0)
	{
		LCD_Clear(WHITE);
		LCD_ShowChinese(16, 60, "暂无数据", LCD_16X16, RED, WHITE, 1);
		Delay_ms(2000);
		LCD_Clear(WHITE);
		return 0;
	}

	uint8_t chartType = 0; // 0=温度, 1=光照
	int16_t offset = 0;	   // 图表偏移量（向右滚动为正）
	uint8_t needRedraw = 1;

	// 首次绘制
	DrawStorageChart(chartType, offset, totalRecords);

	while (1)
	{
		// KEY1: 向左移动
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			if (offset > 0)
			{
				offset--;
				needRedraw = 1;
			}
		}

		// KEY2: 向右移动
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			// 最大偏移量为总记录数减去屏幕显示点数
			int16_t maxOffset = totalRecords - 25;
			if (maxOffset < 0)
				maxOffset = 0;
			if (offset < maxOffset)
			{
				offset++;
				needRedraw = 1;
			}
		}

		// KEY3单击: 切换温度/光照
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			chartType = 1 - chartType;
			needRedraw = 1;
		}

		// KEY3长按: 退出
		if (Key_Check(KEY_3, KEY_LONG))
		{
			LCD_Clear(WHITE);
			return 0;
		}

		// 重绘图表
		if (needRedraw)
		{
			needRedraw = 0;
			DrawStorageChart(chartType, offset, totalRecords);
		}

		Delay_ms(10);
	}
}

// 绘制存储数据图表
void DrawStorageChart(uint8_t chartType, int16_t offset, uint8_t totalRecords)
{
	LCD_Clear(WHITE);

	// 显示标题和类型
	if (chartType == 0)
	{
		LCD_ShowChinese(0, 0, "温度曲线", LCD_16X16, BLACK, WHITE, 1);
	}
	else
	{
		LCD_ShowChinese(0, 0, "光照曲线", LCD_16X16, BLACK, WHITE, 1);
	}

	// 显示记录范围信息
	char info[20];
	uint8_t startRecord = offset + 1;
	uint8_t endRecord = offset + 25;
	if (endRecord > totalRecords)
		endRecord = totalRecords;
	sprintf(info, "%d-%d/%d", startRecord, endRecord, totalRecords);
	LCD_ShowString(64, 0, info, LCD_8X16, BLUE, WHITE, 0);

	// 计算实际要显示的数据点数
	uint8_t displayCount = totalRecords - offset;
	if (displayCount > 25)
		displayCount = 25;

	// 如果没有数据可显示
	if (displayCount == 0)
	{
		LCD_ShowChinese(32, 60, "无数据", LCD_16X16, RED, WHITE, 1);
		return;
	}

	// 读取数据并计算最大最小值
	int16_t dataMax = -32768, dataMin = 32767;
	SensorData sensorData;

	// 第一遍扫描：找出最大最小值
	for (uint8_t i = 0; i < displayCount; i++)
	{
		uint8_t index = offset + i; // 记录索引从0开始

		if (DataStorage_Read(index, &sensorData) == 0)
		{
			int16_t value;
			if (chartType == 0)
			{
				value = sensorData.Temp; // 温度值已经×10
			}
			else
			{
				value = (int16_t)sensorData.Light;
			}

			if (value > dataMax)
				dataMax = value;
			if (value < dataMin)
				dataMin = value;
		}
	}

	// 防止最大最小值相同
	if (dataMax == dataMin)
	{
		dataMax += 10;
		dataMin -= 10;
	}

	// 显示最大最小值
	LCD_ShowString(0, 20, "Max:", LCD_6X8, BLACK, WHITE, 0);
	LCD_ShowString(0, 30, "Min:", LCD_6X8, BLACK, WHITE, 0);

	if (chartType == 0)
	{
		LCD_ShowFloatNum(24, 20, dataMax / 10.0f, 1, LCD_6X8, RED, WHITE, 0, 0);
		LCD_ShowFloatNum(24, 30, dataMin / 10.0f, 1, LCD_6X8, BLUE, WHITE, 0, 0);
	}
	else
	{
		LCD_ShowNum(24, 20, dataMax, LCD_6X8, RED, WHITE, 0, 0, 0);
		LCD_ShowNum(24, 30, dataMin, LCD_6X8, BLUE, WHITE, 0, 0, 0);
	}

	// 绘制图表区域边框
	LCD_DrawRectangle(0, 50, 127, 159, BLACK);

	// 第二遍扫描：绘制曲线
	int16_t prevX = -1, prevY = -1;
	uint8_t pixelStep = 5; // 每个点间隔5像素
	int16_t dataRange = dataMax - dataMin;

	for (uint8_t i = 0; i < displayCount; i++)
	{
		uint8_t index = offset + i + 1;

		if (DataStorage_Read(index, &sensorData) == 1)
		{
			int16_t value;
			if (chartType == 0)
			{
				value = sensorData.Temp;
			}
			else
			{
				value = (int16_t)sensorData.Light;
			}

			// 计算坐标
			int16_t x = 2 + i * pixelStep;
			int16_t y = 157 - ((int32_t)(value - dataMin) * 105 / dataRange);

			// 确保Y坐标在有效范围内
			if (y < 52)
				y = 52;
			if (y > 157)
				y = 157;

			// 绘制点
			uint16_t color = (chartType == 0) ? RED : GREEN;
			LCD_DrawRectangle_Fill(x - 1, y - 1, x + 1, y + 1, color);

			// 绘制连线
			if (i > 0 && prevX >= 0)
			{
				LCD_DrawLine(prevX, prevY, x, y, color);
			}

			prevX = x;
			prevY = y;
		}
	}

	// 显示操作提示
	LCD_ShowString(0, 145, "K1<", LCD_6X8, BLACK, WHITE, 0);
	LCD_ShowString(24, 145, "K2>", LCD_6X8, BLACK, WHITE, 0);
	LCD_ShowString(48, 145, "K3:SW", LCD_6X8, BLACK, WHITE, 0);
	LCD_ShowString(80, 145, "LNG:EXIT", LCD_6X8, BLACK, WHITE, 0);
}

int Menu4_ToggleSave(void)
{
	uint8_t showWarning = 0;  // 显示警告标志
	LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
	SaveInterval_Time[0] = SaveInterval / 3600;
	SaveInterval_Time[1] = (SaveInterval % 3600) / 60;
	SaveInterval_Time[2] = (SaveInterval % 3600) % 60;
	LCD_ShowString(40, 100, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(80, 100, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, BLACK, WHITE, 0, 1, 2);
	LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);
	LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2);
	while (1)
	{
		if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT))
		{
			// 检查是否尝试从关闭切换到开启
			if (ToggleSaveFlag == 0)
			{
				// 检查存储是否已满
				uint8_t currentCount = DataStorage_GetCount();
				if (currentCount >= MaxRecordCount)
				{
					showWarning = 1;  // 显示警告
				}
				else
				{
					ToggleSaveFlag = 1;  // 允许开启
					showWarning = 0;
				}
			}
			else
			{
				ToggleSaveFlag = 0;  // 允许关闭
				showWarning = 0;
			}
		}
		if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT))
		{
			// 检查是否尝试从关闭切换到开启
			if (ToggleSaveFlag == 0)
			{
				// 检查存储是否已满
				uint8_t currentCount = DataStorage_GetCount();
				if (currentCount >= MaxRecordCount)
				{
					showWarning = 1;  // 显示警告
				}
				else
				{
					ToggleSaveFlag = 1;  // 允许开启
					showWarning = 0;
				}
			}
			else
			{
				ToggleSaveFlag = 0;  // 允许关闭
				showWarning = 0;
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			LCD_Clear(WHITE);
			return 0;
		}
		LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
		LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
		LCD_ShowChinese(0, 60, "存储间隔", LCD_16X16, BLACK, WHITE, 0);
		LCD_ShowString(72, 40, ">", LCD_8X16, WHITE, BLACK, 0);
		if (ToggleSaveFlag == 0)
		{
			LCD_ShowChinese(80, 40, "关", LCD_16X16, BLACK, WHITE, 0);
		}
		else
		{
			LCD_ShowChinese(80, 40, "开", LCD_16X16, BLACK, WHITE, 0);
		}
		
		// 显示警告信息
		if (showWarning)
		{
			LCD_ShowChinese(0, 120, "存储已满", LCD_16X16, RED, WHITE, 1);
			LCD_ShowChinese(64, 120, "请擦除", LCD_16X16, RED, WHITE, 0);
		}
		else
		{
			// 清除警告区域
			LCD_ShowString(0, 120, "                ", LCD_8X16, WHITE, WHITE, 0);
		}
	}
}

int Menu4_SaveInterval(void)
{
	uint8_t SaveIntervalFlag = 1;
	uint8_t SwitchFlag = 0;
	LCD_ShowChinese(0, 0, "历史数据", LCD_16X16, BLACK, WHITE, 1);
	LCD_ShowString(0, 20, "<---", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 40, "自动存储", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowChinese(0, 60, "存储间隔", LCD_16X16, BLACK, WHITE, 0);
	LCD_ShowString(40, 100, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(80, 100, ":", LCD_8X16, BLACK, WHITE, 0);
	SaveInterval_Time[0] = SaveInterval / 3600;
	SaveInterval_Time[1] = (SaveInterval % 3600) / 60;
	SaveInterval_Time[2] = (SaveInterval % 3600) % 60;
	while (1)
	{
		if (SwitchFlag == 0)
		{
			if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT)) // KEY_1：上一项（小时→秒循环）
			{
				SaveIntervalFlag--;
				if (SaveIntervalFlag == 0)
				{
					SaveIntervalFlag = 3;
				}
			}
			else if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT)) // KEY_2：下一项（秒→小时循环）
			{
				SaveIntervalFlag++;
				if (SaveIntervalFlag == 4)
				{
					SaveIntervalFlag = 1;
				}
			}
		}
		else if (SwitchFlag == 1)
		{
			if (Key_Check(KEY_1, KEY_UP) || Key_Check(KEY_1, KEY_REPEAT)) // KEY_1：减少
			{
				switch (SaveIntervalFlag)
				{
				case 1:
				{
					if (SaveInterval_Time[0] == 0)
					{
						SaveInterval_Time[0] = 23;
					}
					else
					{
						SaveInterval_Time[0]--;
					}
					break;
				}
				case 2:
				{
					if (SaveInterval_Time[1] == 0)
					{
						SaveInterval_Time[1] = 59;
					}
					else
					{
						SaveInterval_Time[1]--;
					}
					break;
				}
				case 3:
				{
					if (SaveInterval_Time[2] == 0)
					{
						SaveInterval_Time[2] = 59;
					}
					else
					{
						SaveInterval_Time[2]--;
					}
					break;
				}
				}
				SaveInterval = SaveInterval_Time[0] * 3600 + SaveInterval_Time[1] * 60 + SaveInterval_Time[2];
				// 防止间隔为0，最小1秒
				if (SaveInterval == 0)
				{
					SaveInterval = 1;
					SaveInterval_Time[2] = 1;
				}
			}
			else if (Key_Check(KEY_2, KEY_UP) || Key_Check(KEY_2, KEY_REPEAT)) // KEY_2：增加
			{
				switch (SaveIntervalFlag)
				{
				case 1:
				{
					SaveInterval_Time[0]++;
					if (SaveInterval_Time[0] == 24)
					{
						SaveInterval_Time[0] = 0;
					}
					break;
				}
				case 2:
				{
					SaveInterval_Time[1]++;
					if (SaveInterval_Time[1] == 60)
					{
						SaveInterval_Time[1] = 0;
					}
					break;
				}
				case 3:
				{
					SaveInterval_Time[2]++;
					if (SaveInterval_Time[2] == 60)
					{
						SaveInterval_Time[2] = 0;
					}
					break;
				}
				}
				SaveInterval = SaveInterval_Time[0] * 3600 + SaveInterval_Time[1] * 60 + SaveInterval_Time[2];
				// 防止间隔为0，最小1秒
				if (SaveInterval == 0)
				{
					SaveInterval = 1;
					SaveInterval_Time[2] = 1;
				}
			}
		}
		if (Key_Check(KEY_3, KEY_SINGLE))
		{
			SwitchFlag = !SwitchFlag;
		}
		else if (Key_Check(KEY_3, KEY_LONG))
		{
			LCD_Clear(WHITE);
			return 0;
		}

		// 显示当前模式
		if (SwitchFlag == 0)
		{
			LCD_ShowChinese(0, 120, "切换", LCD_16X16, BLACK, WHITE, 1);
		}
		else
		{
			LCD_ShowChinese(0, 120, "调整", LCD_16X16, BLACK, WHITE, 1);
		}

