bigroot969/VSCode_STM32_Demo/Hardware/Menu.c
		switch (SaveIntervalFlag)
		{
		case 1:
		{
			LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, WHITE, BLACK, 0, 1, 2);
			LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			break;
		}
		case 2:
		{
			LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, WHITE, BLACK, 0, 1, 2);
			LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			break;
		}
		case 3:
		{
			LCD_ShowNum(16, 100, SaveInterval_Time[0], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(56, 100, SaveInterval_Time[1], LCD_8X16, BLACK, WHITE, 0, 1, 2);
			LCD_ShowNum(96, 100, SaveInterval_Time[2], LCD_8X16, WHITE, BLACK, 0, 1, 2);
			break;
		}
		}
		if (ToggleSaveFlag == 0)
		{
			LCD_ShowChinese(80, 40, "关", LCD_16X16, BLACK, WHITE, 0);
		}
		else
		{
			LCD_ShowChinese(80, 40, "开", LCD_16X16, BLACK, WHITE, 0);
		}
	}
}

void LCD_ShowRecord(uint8_t RecordID)
{
	SensorData record;
	NowTotalRecords = DataStorage_GetCount();
	if (RecordID >= NowTotalRecords)
	{
		LCD_ShowChinese(32, 120, "无记录", LCD_16X16, BLACK, WHITE, 0);
		return;
	}
	
	// 读取记录并检查是否成功
	if (DataStorage_Read(RecordID, &record) != 0)
	{
		LCD_ShowChinese(32, 120, "读取错误", LCD_16X16, RED, WHITE, 0);
		return;
	}
	
	char IndexStr[20];
	float temp = record.Temp / 10.0f;
	sprintf((char *)IndexStr, "%03d/%03d", RecordID + 1, NowTotalRecords);
	LCD_ShowString(32, 120, IndexStr, LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowNum(40, 40, record.Year, LCD_8X16, BLACK, WHITE, 0, 1, 4);	 // 年，固定4位
	LCD_ShowNum(80, 40, record.Month, LCD_8X16, BLACK, WHITE, 0, 1, 2);	 // 月，固定2位
	LCD_ShowNum(104, 40, record.Day, LCD_8X16, BLACK, WHITE, 0, 1, 2);	 // 日，固定2位
	LCD_ShowNum(40, 60, record.Hour, LCD_8X16, BLACK, WHITE, 0, 1, 2);	 // 时，固定2位
	LCD_ShowNum(64, 60, record.Minute, LCD_8X16, BLACK, WHITE, 0, 1, 2); // 分，固定2位
	LCD_ShowNum(88, 60, record.Second, LCD_8X16, BLACK, WHITE, 0, 1, 2); // 秒，固定2位
	LCD_ShowNum(88, 80, record.Light, LCD_8X16, BLACK, WHITE, 0, 1, 3);	 // 光照，固定3位
	LCD_ShowFloatNum(72, 100, temp, 1, LCD_8X16, BLACK, WHITE, 0, 6);	 // 温度，固定6字符宽度

	LCD_ShowString(72, 40, "-", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(96, 40, "-", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(56, 60, ":", LCD_8X16, BLACK, WHITE, 0);
	LCD_ShowString(80, 60, ":", LCD_8X16, BLACK, WHITE, 0);
}

void StopWatch_Tick(void)
{
	static uint16_t StopWatchCount;
	StopWatchCount++;
	if (StopWatchCount >= 1000)
	{
		StopWatchCount = 0;
		if (StopWatchStartFlag == 1)
		{
			second++;
			if (second >= 60)
			{
				second = 0;
				minute++;
				if (minute >= 60)
				{
					minute = 0;
					hour++;
					if (hour > 99)
					{
						hour = 0;
					}
				}
			}
		}
	}
}

void TIM4_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM4, TIM_IT_Update) == SET)
	{
		Key_Tick();
		StopWatch_Tick();
		TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
	}
}

void TIM2_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
	{
		TimerCount++;
		if (TimerCount >= SaveInterval)
		{
			TimerCount = 0;
			SaveFlag = 1;
		}

		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	}
}
